{
  "story_0": {
    "id": "story_0",
    "content": "\n        Aujourd'hui, nous allons vous raconter une histoire amusante sur Mickey et Donald. Ils partent en quête d'un trésor caché dans le parc d'attractions. ",
    "type": "StoryNode",
    "children": [
      "question_0_0",
      "question_0_1"
    ],
    "parents": []
  },
  "story_1": {
    "id": "story_1",
    "content": "\n\n        Mickey et Donald reçoivent une carte au trésor de Dingo, qui leur dit que le trésor est caché quelque part dans le parc. Ils sont très excités et se mettent en route immédiatement. ",
    "type": "StoryNode",
    "children": [
      "question_1_0",
      "question_1_1"
    ],
    "parents": [
      "question_0_0",
      "question_0_1"
    ]
  },
  "story_2": {
    "id": "story_2",
    "content": "\n\n        En chemin, ils rencontrent Minnie, qui leur donne un indice : \"Cherchez là où les rires résonnent le plus fort.\" Mickey et Donald se regardent, perplexes. \"Où est-ce que les rires résonnent le plus fort dans le parc ?\" se demande Mickey.\n\n        Ils décident de se rendre à la maison hantée, pensant que les rires des enfants qui ont peur pourraient être les plus forts. Mais là-bas, ils ne trouvent que des fantômes qui rigolent. \"Ce n'est pas ici !\" s'exclame Donald, frustré.\n\n        Ils continuent leur quête et arrivent au manège des tasses de thé tournantes. Les enfants rient tellement fort en essayant de ne pas tomber ! \"C'est peut-être ici !\" dit Mickey, plein d'espoir. Ils cherchent partout, mais ne trouvent rien.\n\n        Finalement, ils se rendent au stand de barbe à papa, où les enfants rient en essayant de manger sans se salir. \"C'est ici !\" s'écrie Donald, en voyant une petite boîte cachée sous le stand. Ils l'ouvrent et trouvent le trésor : des bonbons en forme de Mickey et Donald !\n\n        Ils sont ravis et remercient Minnie pour son indice. \"Nous avons réussi notre quête !\" dit Mickey, en riant. Et ils mangent tous les bonbons en célébrant leur victoire.\n    ",
    "type": "StoryNode",
    "children": [],
    "parents": [
      "question_1_0",
      "question_1_1"
    ]
  },
  "question_0_0": {
    "id": "question_0_0",
    "content": "Où Mickey et Donald vont-ils chercher un trésor caché ? ",
    "type": "QuestionNode",
    "children": [
      "story_1"
    ],
    "parents": [
      "story_0"
    ],
    "answer": " dans le parc d'attractions",
    "difficulty": "easy",
    "cognitive_area": null
  },
  "question_0_1": {
    "id": "question_0_1",
    "content": "Quels sont les personnages principaux de l'histoire et où cherchent-ils un trésor caché ? ",
    "type": "QuestionNode",
    "children": [
      "story_1"
    ],
    "parents": [
      "story_0"
    ],
    "answer": " Les personnages principaux sont Mickey et Donald, et ils cherchent un trésor caché dans le parc d'attractions.",
    "difficulty": "difficult",
    "cognitive_area": null
  },
  "question_1_0": {
    "id": "question_1_0",
    "content": "Qui a envoyé la carte au trésor à Mickey et Donald ? ",
    "type": "QuestionNode",
    "children": [
      "story_2"
    ],
    "parents": [
      "story_1"
    ],
    "answer": " Dingo",
    "difficulty": "easy",
    "cognitive_area": null
  },
  "question_1_1": {
    "id": "question_1_1",
    "content": "Quelle est la première chose que Mickey et Donald font après avoir reçu la carte au trésor de Dingo? ",
    "type": "QuestionNode",
    "children": [
      "story_2"
    ],
    "parents": [
      "story_1"
    ],
    "answer": " Ils se mettent en route immédiatement.",
    "difficulty": "difficult",
    "cognitive_area": null
  }
}